Revit 2024 API
BuiltInFailures.GeneralFailures.EnterValidRealGreaterThan Property
 Enter a number greater than [Value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId EnterValidRealGreaterThan { get; }
Visual Basic
Public Shared ReadOnly Property EnterValidRealGreaterThan As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ EnterValidRealGreaterThan {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace